kholia/hal_wch/ch32fun/ch32x00xhw.h
#define TIM1_CTLR1_CAPOV                        ((uint16_t)0x4000) /* Capture value mode configuration */
#define TIM1_CTLR1_CAPLVL                       ((uint16_t)0x8000) /* Capture level indication enable in dual-edge capture */

/*******************  Bit definition for TIM1_CTLR2 register  *****************/
#define TIM1_CTLR2_CCPC                         ((uint16_t)0x0001) /* Capture/Compare Preloaded Control */
#define TIM1_CTLR2_CCUS                         ((uint16_t)0x0004) /* Capture/Compare Control Update Selection */
#define TIM1_CTLR2_CCDS                         ((uint16_t)0x0008) /* Capture/Compare DMA Selection */
#define TIM1_CTLR2_MMS                          ((uint16_t)0x0070) /* MMS[2:0] bits (Master Mode Selection) */
#define TIM1_CTLR2_MMS_0                        ((uint16_t)0x0010) /* Bit 0 */
#define TIM1_CTLR2_MMS_1                        ((uint16_t)0x0020) /* Bit 1 */
#define TIM1_CTLR2_MMS_2                        ((uint16_t)0x0040) /* Bit 2 */
#define TIM1_CTLR2_TI1S                         ((uint16_t)0x0080) /* TI1 Selection */
#define TIM1_CTLR2_OIS1                         ((uint16_t)0x0100) /* Output Idle state 1 (OC1 output) */
#define TIM1_CTLR2_OIS1N                        ((uint16_t)0x0200) /* Output Idle state 1 (OC1N output) */
#define TIM1_CTLR2_OIS2                         ((uint16_t)0x0400) /* Output Idle state 2 (OC2 output) */
#define TIM1_CTLR2_OIS2N                        ((uint16_t)0x0800) /* Output Idle state 2 (OC2N output) */
#define TIM1_CTLR2_OIS3                         ((uint16_t)0x1000) /* Output Idle state 3 (OC3 output) */
#define TIM1_CTLR2_OIS3N                        ((uint16_t)0x2000) /* Output Idle state 3 (OC3N output) */
#define TIM1_CTLR2_OIS4                         ((uint16_t)0x4000) /* Output Idle state 4 (OC4 output) */

/*******************  Bit definition for TIM1_SMCFGR register  ****************/
#define TIM1_SMCFGR_SMS                         ((uint16_t)0x0007) /* SMS[2:0] bits (Slave mode selection) */
#define TIM1_SMCFGR_SMS_0                       ((uint16_t)0x0001) /* Bit 0 */
#define TIM1_SMCFGR_SMS_1                       ((uint16_t)0x0002) /* Bit 1 */
#define TIM1_SMCFGR_SMS_2                       ((uint16_t)0x0004) /* Bit 2 */

#define TIM1_SMCFGR_TS                          ((uint16_t)0x0070) /* TS[2:0] bits (Trigger selection) */
#define TIM1_SMCFGR_TS_0                        ((uint16_t)0x0010) /* Bit 0 */
#define TIM1_SMCFGR_TS_1                        ((uint16_t)0x0020) /* Bit 1 */
#define TIM1_SMCFGR_TS_2                        ((uint16_t)0x0040) /* Bit 2 */

#define TIM1_SMCFGR_MSM                         ((uint16_t)0x0080) /* Master/slave mode */

#define TIM1_SMCFGR_ETF                         ((uint16_t)0x0F00) /* ETF[3:0] bits (External trigger filter) */
#define TIM1_SMCFGR_ETF_0                       ((uint16_t)0x0100) /* Bit 0 */
#define TIM1_SMCFGR_ETF_1                       ((uint16_t)0x0200) /* Bit 1 */
#define TIM1_SMCFGR_ETF_2                       ((uint16_t)0x0400) /* Bit 2 */
#define TIM1_SMCFGR_ETF_3                       ((uint16_t)0x0800) /* Bit 3 */

#define TIM1_SMCFGR_ETPS                        ((uint16_t)0x3000) /* ETPS[1:0] bits (External trigger prescaler) */
#define TIM1_SMCFGR_ETPS_0                      ((uint16_t)0x1000) /* Bit 0 */
#define TIM1_SMCFGR_ETPS_1                      ((uint16_t)0x2000) /* Bit 1 */

#define TIM1_SMCFGR_ECE                         ((uint16_t)0x4000) /* External clock enable */
#define TIM1_SMCFGR_ETP                         ((uint16_t)0x8000) /* External trigger polarity */

/*******************  Bit definition for TIM1_DMAINTENR register  *************/
#define TIM1_DMAINTENR_UIE                      ((uint16_t)0x0001) /* Update interrupt enable */
#define TIM1_DMAINTENR_CC1IE                    ((uint16_t)0x0002) /* Capture/Compare 1 interrupt enable */
#define TIM1_DMAINTENR_CC2IE                    ((uint16_t)0x0004) /* Capture/Compare 2 interrupt enable */
#define TIM1_DMAINTENR_CC3IE                    ((uint16_t)0x0008) /* Capture/Compare 3 interrupt enable */
#define TIM1_DMAINTENR_CC4IE                    ((uint16_t)0x0010) /* Capture/Compare 4 interrupt enable */
#define TIM1_DMAINTENR_COMIE                    ((uint16_t)0x0020) /* COM interrupt enable */
#define TIM1_DMAINTENR_TIE                      ((uint16_t)0x0040) /* Trigger interrupt enable */
#define TIM1_DMAINTENR_BIE                      ((uint16_t)0x0080) /* Break interrupt enable */
#define TIM1_DMAINTENR_UDE                      ((uint16_t)0x0100) /* Update DMA request enable */
#define TIM1_DMAINTENR_CC1DE                    ((uint16_t)0x0200) /* Capture/Compare 1 DMA request enable */
#define TIM1_DMAINTENR_CC2DE                    ((uint16_t)0x0400) /* Capture/Compare 2 DMA request enable */
#define TIM1_DMAINTENR_CC3DE                    ((uint16_t)0x0800) /* Capture/Compare 3 DMA request enable */
#define TIM1_DMAINTENR_CC4DE                    ((uint16_t)0x1000) /* Capture/Compare 4 DMA request enable */
#define TIM1_DMAINTENR_COMDE                    ((uint16_t)0x2000) /* COM DMA request enable */
#define TIM1_DMAINTENR_TDE                      ((uint16_t)0x4000) /* Trigger DMA request enable */

/*******************  Bit definition for TIM1_INTFR register  *****************/
#define TIM1_INTFR_UIF                          ((uint16_t)0x0001) /* Update interrupt Flag */
#define TIM1_INTFR_CC1IF                        ((uint16_t)0x0002) /* Capture/Compare 1 interrupt Flag */
#define TIM1_INTFR_CC2IF                        ((uint16_t)0x0004) /* Capture/Compare 2 interrupt Flag */
#define TIM1_INTFR_CC3IF                        ((uint16_t)0x0008) /* Capture/Compare 3 interrupt Flag */
#define TIM1_INTFR_CC4IF                        ((uint16_t)0x0010) /* Capture/Compare 4 interrupt Flag */
#define TIM1_INTFR_COMIF                        ((uint16_t)0x0020) /* COM interrupt Flag */
#define TIM1_INTFR_TIF                          ((uint16_t)0x0040) /* Trigger interrupt Flag */
#define TIM1_INTFR_BIF                          ((uint16_t)0x0080) /* Break interrupt Flag */
#define TIM1_INTFR_CC1OF                        ((uint16_t)0x0200) /* Capture/Compare 1 Overcapture Flag */
#define TIM1_INTFR_CC2OF                        ((uint16_t)0x0400) /* Capture/Compare 2 Overcapture Flag */
#define TIM1_INTFR_CC3OF                        ((uint16_t)0x0800) /* Capture/Compare 3 Overcapture Flag */
#define TIM1_INTFR_CC4OF                        ((uint16_t)0x1000) /* Capture/Compare 4 Overcapture Flag */

