kholia/hal_wch/ch32fun/ch32x00xhw.h
/*******************  Bit definition for TIM1_SWEVGR register  ****************/
#define TIM1_SWEVGR_UG                          ((uint16_t)0x0001) /* Update Generation */
#define TIM1_SWEVGR_CC1G                        ((uint16_t)0x0002) /* Capture/Compare 1 Generation */
#define TIM1_SWEVGR_CC2G                        ((uint16_t)0x0004) /* Capture/Compare 2 Generation */
#define TIM1_SWEVGR_CC3G                        ((uint16_t)0x0008) /* Capture/Compare 3 Generation */
#define TIM1_SWEVGR_CC4G                        ((uint16_t)0x0010) /* Capture/Compare 4 Generation */
#define TIM1_SWEVGR_COMG                        ((uint16_t)0x0020) /* Capture/Compare Control Update Generation */
#define TIM1_SWEVGR_TG                          ((uint16_t)0x0040) /* Trigger Generation */
#define TIM1_SWEVGR_BG                          ((uint16_t)0x0080) /* Break Generation */

/******************  Bit definition for TIM1_CHCTLR1 register  ****************/
#define TIM1_CHCTLR1_CC1S                       ((uint16_t)0x0003) /* CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define TIM1_CHCTLR1_CC1S_0                     ((uint16_t)0x0001) /* Bit 0 */
#define TIM1_CHCTLR1_CC1S_1                     ((uint16_t)0x0002) /* Bit 1 */

#define TIM1_CHCTLR1_OC1FE                      ((uint16_t)0x0004) /* Output Compare 1 Fast enable */
#define TIM1_CHCTLR1_OC1PE                      ((uint16_t)0x0008) /* Output Compare 1 Preload enable */

#define TIM1_CHCTLR1_OC1M                       ((uint16_t)0x0070) /* OC1M[2:0] bits (Output Compare 1 Mode) */
#define TIM1_CHCTLR1_OC1M_0                     ((uint16_t)0x0010) /* Bit 0 */
#define TIM1_CHCTLR1_OC1M_1                     ((uint16_t)0x0020) /* Bit 1 */
#define TIM1_CHCTLR1_OC1M_2                     ((uint16_t)0x0040) /* Bit 2 */

#define TIM1_CHCTLR1_OC1CE                      ((uint16_t)0x0080) /* Output Compare 1Clear Enable */

#define TIM1_CHCTLR1_CC2S                       ((uint16_t)0x0300) /* CC2S[1:0] bits (Capture/Compare 2 Selection) */
#define TIM1_CHCTLR1_CC2S_0                     ((uint16_t)0x0100) /* Bit 0 */
#define TIM1_CHCTLR1_CC2S_1                     ((uint16_t)0x0200) /* Bit 1 */

#define TIM1_CHCTLR1_OC2FE                      ((uint16_t)0x0400) /* Output Compare 2 Fast enable */
#define TIM1_CHCTLR1_OC2PE                      ((uint16_t)0x0800) /* Output Compare 2 Preload enable */

#define TIM1_CHCTLR1_OC2M                       ((uint16_t)0x7000) /* OC2M[2:0] bits (Output Compare 2 Mode) */
#define TIM1_CHCTLR1_OC2M_0                     ((uint16_t)0x1000) /* Bit 0 */
#define TIM1_CHCTLR1_OC2M_1                     ((uint16_t)0x2000) /* Bit 1 */
#define TIM1_CHCTLR1_OC2M_2                     ((uint16_t)0x4000) /* Bit 2 */

#define TIM1_CHCTLR1_OC2CE                      ((uint16_t)0x8000) /* Output Compare 2 Clear Enable */

#define TIM1_CHCTLR1_IC1PSC                     ((uint16_t)0x000C) /* IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
#define TIM1_CHCTLR1_IC1PSC_0                   ((uint16_t)0x0004) /* Bit 0 */
#define TIM1_CHCTLR1_IC1PSC_1                   ((uint16_t)0x0008) /* Bit 1 */

#define TIM1_CHCTLR1_IC1F                       ((uint16_t)0x00F0) /* IC1F[3:0] bits (Input Capture 1 Filter) */
#define TIM1_CHCTLR1_IC1F_0                     ((uint16_t)0x0010) /* Bit 0 */
#define TIM1_CHCTLR1_IC1F_1                     ((uint16_t)0x0020) /* Bit 1 */
#define TIM1_CHCTLR1_IC1F_2                     ((uint16_t)0x0040) /* Bit 2 */
#define TIM1_CHCTLR1_IC1F_3                     ((uint16_t)0x0080) /* Bit 3 */

#define TIM1_CHCTLR1_IC2PSC                     ((uint16_t)0x0C00) /* IC2PSC[1:0] bits (Input Capture 2 Prescaler) */
#define TIM1_CHCTLR1_IC2PSC_0                   ((uint16_t)0x0400) /* Bit 0 */
#define TIM1_CHCTLR1_IC2PSC_1                   ((uint16_t)0x0800) /* Bit 1 */

#define TIM1_CHCTLR1_IC2F                       ((uint16_t)0xF000) /* IC2F[3:0] bits (Input Capture 2 Filter) */
#define TIM1_CHCTLR1_IC2F_0                     ((uint16_t)0x1000) /* Bit 0 */
#define TIM1_CHCTLR1_IC2F_1                     ((uint16_t)0x2000) /* Bit 1 */
#define TIM1_CHCTLR1_IC2F_2                     ((uint16_t)0x4000) /* Bit 2 */
#define TIM1_CHCTLR1_IC2F_3                     ((uint16_t)0x8000) /* Bit 3 */

/******************  Bit definition for TIM1_CHCTLR2 register  ****************/
#define TIM1_CHCTLR2_CC3S                       ((uint16_t)0x0003) /* CC3S[1:0] bits (Capture/Compare 3 Selection) */
#define TIM1_CHCTLR2_CC3S_0                     ((uint16_t)0x0001) /* Bit 0 */
#define TIM1_CHCTLR2_CC3S_1                     ((uint16_t)0x0002) /* Bit 1 */

#define TIM1_CHCTLR2_OC3FE                      ((uint16_t)0x0004) /* Output Compare 3 Fast enable */
#define TIM1_CHCTLR2_OC3PE                      ((uint16_t)0x0008) /* Output Compare 3 Preload enable */

#define TIM1_CHCTLR2_OC3M                       ((uint16_t)0x0070) /* OC3M[2:0] bits (Output Compare 3 Mode) */
#define TIM1_CHCTLR2_OC3M_0                     ((uint16_t)0x0010) /* Bit 0 */
#define TIM1_CHCTLR2_OC3M_1                     ((uint16_t)0x0020) /* Bit 1 */
#define TIM1_CHCTLR2_OC3M_2                     ((uint16_t)0x0040) /* Bit 2 */

#define TIM1_CHCTLR2_OC3CE                      ((uint16_t)0x0080) /* Output Compare 3 Clear Enable */

#define TIM1_CHCTLR2_CC4S                       ((uint16_t)0x0300) /* CC4S[1:0] bits (Capture/Compare 4 Selection) */
#define TIM1_CHCTLR2_CC4S_0                     ((uint16_t)0x0100) /* Bit 0 */
#define TIM1_CHCTLR2_CC4S_1                     ((uint16_t)0x0200) /* Bit 1 */

#define TIM1_CHCTLR2_OC4FE                      ((uint16_t)0x0400) /* Output Compare 4 Fast enable */
#define TIM1_CHCTLR2_OC4PE                      ((uint16_t)0x0800) /* Output Compare 4 Preload enable */

#define TIM1_CHCTLR2_OC4M                       ((uint16_t)0x7000) /* OC4M[2:0] bits (Output Compare 4 Mode) */
#define TIM1_CHCTLR2_OC4M_0                     ((uint16_t)0x1000) /* Bit 0 */
#define TIM1_CHCTLR2_OC4M_1                     ((uint16_t)0x2000) /* Bit 1 */
#define TIM1_CHCTLR2_OC4M_2                     ((uint16_t)0x4000) /* Bit 2 */

