kholia/hal_wch/ch32fun/ch32x00xhw.h
#define TIM1_CHCTLR2_OC4CE                      ((uint16_t)0x8000) /* Output Compare 4 Clear Enable */

#define TIM1_CHCTLR2_IC3PSC                     ((uint16_t)0x000C) /* IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
#define TIM1_CHCTLR2_IC3PSC_0                   ((uint16_t)0x0004) /* Bit 0 */
#define TIM1_CHCTLR2_IC3PSC_1                   ((uint16_t)0x0008) /* Bit 1 */

#define TIM1_CHCTLR2_IC3F                       ((uint16_t)0x00F0) /* IC3F[3:0] bits (Input Capture 3 Filter) */
#define TIM1_CHCTLR2_IC3F_0                     ((uint16_t)0x0010) /* Bit 0 */
#define TIM1_CHCTLR2_IC3F_1                     ((uint16_t)0x0020) /* Bit 1 */
#define TIM1_CHCTLR2_IC3F_2                     ((uint16_t)0x0040) /* Bit 2 */
#define TIM1_CHCTLR2_IC3F_3                     ((uint16_t)0x0080) /* Bit 3 */

#define TIM1_CHCTLR2_IC4PSC                     ((uint16_t)0x0C00) /* IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
#define TIM1_CHCTLR2_IC4PSC_0                   ((uint16_t)0x0400) /* Bit 0 */
#define TIM1_CHCTLR2_IC4PSC_1                   ((uint16_t)0x0800) /* Bit 1 */

#define TIM1_CHCTLR2_IC4F                       ((uint16_t)0xF000) /* IC4F[3:0] bits (Input Capture 4 Filter) */
#define TIM1_CHCTLR2_IC4F_0                     ((uint16_t)0x1000) /* Bit 0 */
#define TIM1_CHCTLR2_IC4F_1                     ((uint16_t)0x2000) /* Bit 1 */
#define TIM1_CHCTLR2_IC4F_2                     ((uint16_t)0x4000) /* Bit 2 */
#define TIM1_CHCTLR2_IC4F_3                     ((uint16_t)0x8000) /* Bit 3 */

/*******************  Bit definition for TIM1_CCER register  ******************/
#define TIM1_CCER_CC1E                          ((uint16_t)0x0001) /* Capture/Compare 1 output enable */
#define TIM1_CCER_CC1P                          ((uint16_t)0x0002) /* Capture/Compare 1 output Polarity */
#define TIM1_CCER_CC1NE                         ((uint16_t)0x0004) /* Capture/Compare 1 Complementary output enable */
#define TIM1_CCER_CC1NP                         ((uint16_t)0x0008) /* Capture/Compare 1 Complementary output Polarity */
#define TIM1_CCER_CC2E                          ((uint16_t)0x0010) /* Capture/Compare 2 output enable */
#define TIM1_CCER_CC2P                          ((uint16_t)0x0020) /* Capture/Compare 2 output Polarity */
#define TIM1_CCER_CC2NE                         ((uint16_t)0x0040) /* Capture/Compare 2 Complementary output enable */
#define TIM1_CCER_CC2NP                         ((uint16_t)0x0080) /* Capture/Compare 2 Complementary output Polarity */
#define TIM1_CCER_CC3E                          ((uint16_t)0x0100) /* Capture/Compare 3 output enable */
#define TIM1_CCER_CC3P                          ((uint16_t)0x0200) /* Capture/Compare 3 output Polarity */
#define TIM1_CCER_CC3NE                         ((uint16_t)0x0400) /* Capture/Compare 3 Complementary output enable */
#define TIM1_CCER_CC3NP                         ((uint16_t)0x0800) /* Capture/Compare 3 Complementary output Polarity */
#define TIM1_CCER_CC4E                          ((uint16_t)0x1000) /* Capture/Compare 4 output enable */
#define TIM1_CCER_CC4P                          ((uint16_t)0x2000) /* Capture/Compare 4 output Polarity */

/*******************  Bit definition for TIM1_CNT register  *******************/
#define TIM1_CNT                                ((uint16_t)0xFFFF) /* Counter Value */

/*******************  Bit definition for TIM1_PSC register  *******************/
#define TIM1_PSC                                ((uint16_t)0xFFFF) /* Prescaler Value */

/*******************  Bit definition for TIM1_ATRLR register  *****************/
#define TIM1_ATRLR                              ((uint16_t)0xFFFF) /* actual auto-reload Value */

/*******************  Bit definition for TIM1_RPTCR register  *****************/
#define TIM1_REP                                ((uint16_t)0x00FF) /* Repetition Counter Value */

/*******************  Bit definition for TIM1_CH1CVR register  ****************/
#define TIM1_CH1CVR_CH1CVR                      ((uint32_t)0x0000FFFF) /* Capture/Compare 1 Value[15:0] */
#define TIM1_CH1CVR_LEVEL1                      ((uint32_t)0x00010000) /* The level indication bit corresponding to the captured value */

/*******************  Bit definition for TIM1_CH2CVR register  ****************/
#define TIM1_CH2CVR_CH2CVR                      ((uint32_t)0x0000FFFF) /* Capture/Compare 2 Value */
#define TIM1_CH2CVR_LEVEL2                      ((uint32_t)0x00010000) /* The level indication bit corresponding to the captured value */

/*******************  Bit definition for TIM1_CH3CVR register  ****************/
#define TIM1_CH3CVR_CH3CVR                      ((uint32_t)0x0000FFFF) /* Capture/Compare 3 Value */
#define TIM1_CH3CVR_LEVEL3                      ((uint32_t)0x00010000) /* The level indication bit corresponding to the captured value */

/*******************  Bit definition for TIM1_CH4CVR register  ****************/
#define TIM1_CH4CVR_CH4CVR                      ((uint32_t)0x0000FFFF) /* Capture/Compare 4 Value */
#define TIM1_CH4CVR_LEVEL4                      ((uint32_t)0x00010000) /* The level indication bit corresponding to the captured value */

/*******************  Bit definition for TIM1_BDTR register  ******************/
#define TIM1_BDTR_DTG                           ((uint16_t)0x00FF) /* DTG[0:7] bits (Dead-Time Generator set-up) */
#define TIM1_BDTR_DTG_0                         ((uint16_t)0x0001) /* Bit 0 */
#define TIM1_BDTR_DTG_1                         ((uint16_t)0x0002) /* Bit 1 */
#define TIM1_BDTR_DTG_2                         ((uint16_t)0x0004) /* Bit 2 */
#define TIM1_BDTR_DTG_3                         ((uint16_t)0x0008) /* Bit 3 */
#define TIM1_BDTR_DTG_4                         ((uint16_t)0x0010) /* Bit 4 */
#define TIM1_BDTR_DTG_5                         ((uint16_t)0x0020) /* Bit 5 */
#define TIM1_BDTR_DTG_6                         ((uint16_t)0x0040) /* Bit 6 */
#define TIM1_BDTR_DTG_7                         ((uint16_t)0x0080) /* Bit 7 */

#define TIM1_BDTR_LOCK                          ((uint16_t)0x0300) /* LOCK[1:0] bits (Lock Configuration) */
#define TIM1_BDTR_LOCK_0                        ((uint16_t)0x0100) /* Bit 0 */
#define TIM1_BDTR_LOCK_1                        ((uint16_t)0x0200) /* Bit 1 */

#define TIM1_BDTR_OSSI                          ((uint16_t)0x0400) /* Off-State Selection for Idle mode */
#define TIM1_BDTR_OSSR                          ((uint16_t)0x0800) /* Off-State Selection for Run mode */
#define TIM1_BDTR_BKE                           ((uint16_t)0x1000) /* Break enable */
#define TIM1_BDTR_BKP                           ((uint16_t)0x2000) /* Break Polarity */
#define TIM1_BDTR_AOE                           ((uint16_t)0x4000) /* Automatic Output enable */
#define TIM1_BDTR_MOE                           ((uint16_t)0x8000) /* Main Output enable */

/*******************  Bit definition for TIM1_DMACFGR register  ***************/
#define TIM1_DMACFGR_DBA                        ((uint16_t)0x001F) /* DBA[4:0] bits (DMA Base Address) */
#define TIM1_DMACFGR_DBA_0                      ((uint16_t)0x0001) /* Bit 0 */
#define TIM1_DMACFGR_DBA_1                      ((uint16_t)0x0002) /* Bit 1 */
#define TIM1_DMACFGR_DBA_2                      ((uint16_t)0x0004) /* Bit 2 */
#define TIM1_DMACFGR_DBA_3                      ((uint16_t)0x0008) /* Bit 3 */
#define TIM1_DMACFGR_DBA_4                      ((uint16_t)0x0010) /* Bit 4 */

#define TIM1_DMACFGR_DBL                        ((uint16_t)0x1F00) /* DBL[4:0] bits (DMA Burst Length) */
#define TIM1_DMACFGR_DBL_0                      ((uint16_t)0x0100) /* Bit 0 */
#define TIM1_DMACFGR_DBL_1                      ((uint16_t)0x0200) /* Bit 1 */
#define TIM1_DMACFGR_DBL_2                      ((uint16_t)0x0400) /* Bit 2 */
#define TIM1_DMACFGR_DBL_3                      ((uint16_t)0x0800) /* Bit 3 */
#define TIM1_DMACFGR_DBL_4                      ((uint16_t)0x1000) /* Bit 4 */

/*******************  Bit definition for TIM1_DMAADR register  ****************/
#define TIM1_DMAADR_DMAB                         ((uint16_t)0xFFFF) /* DMA register for burst accesses */

/******************************************************************************/
/*                                    TIM2                                    */
/******************************************************************************/

