kholia/hal_wch/ch32fun/ch32x00xhw.h
/*******************  Bit definition for TIM2_CTLR1 register  *****************/
#define TIM2_CTLR1_CEN                          ((uint16_t)0x0001) /* Counter enable */
#define TIM2_CTLR1_UDIS                         ((uint16_t)0x0002) /* Update disable */
#define TIM2_CTLR1_URS                          ((uint16_t)0x0004) /* Update request source */
#define TIM2_CTLR1_OPM                          ((uint16_t)0x0008) /* One pulse mode */
#define TIM2_CTLR1_DIR                          ((uint16_t)0x0010) /* Direction */
#define TIM2_CTLR1_CMS                          ((uint16_t)0x0060) /* CMS[1:0] bits (Center-aligned mode selection) */
#define TIM2_CTLR1_CMS_0                        ((uint16_t)0x0020) /* Bit 0 */
#define TIM2_CTLR1_CMS_1                        ((uint16_t)0x0040) /* Bit 1 */

#define TIM2_CTLR1_ARPE                         ((uint16_t)0x0080) /* Auto-reload preload enable */
#define TIM2_CTLR1_CKD                          ((uint16_t)0x0300) /* CKD[1:0] bits (clock division) */
#define TIM2_CTLR1_CKD_0                        ((uint16_t)0x0100) /* Bit 0 */
#define TIM2_CTLR1_CKD_1                        ((uint16_t)0x0200) /* Bit 1 */

#define TIM2_CTLR1_CAPOV                        ((uint16_t)0x4000) /* Capture value mode configuration */
#define TIM2_CTLR1_CAPLVL                       ((uint16_t)0x8000) /* Capture level indication enable in dual-edge capture */

/*******************  Bit definition for TIM2_CTLR2 register  *****************/
#define TIM2_CTLR2_CCDS                         ((uint16_t)0x0008) /* Capture/Compare DMA Selection */
#define TIM2_CTLR2_MMS                          ((uint16_t)0x0070) /* MMS[2:0] bits (Master Mode Selection) */
#define TIM2_CTLR2_MMS_0                        ((uint16_t)0x0010) /* Bit 0 */
#define TIM2_CTLR2_MMS_1                        ((uint16_t)0x0020) /* Bit 1 */
#define TIM2_CTLR2_MMS_2                        ((uint16_t)0x0040) /* Bit 2 */
#define TIM2_CTLR2_TI1S                         ((uint16_t)0x0080) /* TI1 Selection */

/*******************  Bit definition for TIM2_SMCFGR register  ****************/
#define TIM2_SMCFGR_SMS                         ((uint16_t)0x0007) /* SMS[2:0] bits (Slave mode selection) */
#define TIM2_SMCFGR_SMS_0                       ((uint16_t)0x0001) /* Bit 0 */
#define TIM2_SMCFGR_SMS_1                       ((uint16_t)0x0002) /* Bit 1 */
#define TIM2_SMCFGR_SMS_2                       ((uint16_t)0x0004) /* Bit 2 */

#define TIM2_SMCFGR_TS                          ((uint16_t)0x0070) /* TS[2:0] bits (Trigger selection) */
#define TIM2_SMCFGR_TS_0                        ((uint16_t)0x0010) /* Bit 0 */
#define TIM2_SMCFGR_TS_1                        ((uint16_t)0x0020) /* Bit 1 */
#define TIM2_SMCFGR_TS_2                        ((uint16_t)0x0040) /* Bit 2 */

#define TIM2_SMCFGR_MSM                         ((uint16_t)0x0080) /* Master/slave mode */

#define TIM2_SMCFGR_ETF                         ((uint16_t)0x0F00) /* ETF[3:0] bits (External trigger filter) */
#define TIM2_SMCFGR_ETF_0                       ((uint16_t)0x0100) /* Bit 0 */
#define TIM2_SMCFGR_ETF_1                       ((uint16_t)0x0200) /* Bit 1 */
#define TIM2_SMCFGR_ETF_2                       ((uint16_t)0x0400) /* Bit 2 */
#define TIM2_SMCFGR_ETF_3                       ((uint16_t)0x0800) /* Bit 3 */

#define TIM2_SMCFGR_ETPS                        ((uint16_t)0x3000) /* ETPS[1:0] bits (External trigger prescaler) */
#define TIM2_SMCFGR_ETPS_0                      ((uint16_t)0x1000) /* Bit 0 */
#define TIM2_SMCFGR_ETPS_1                      ((uint16_t)0x2000) /* Bit 1 */

#define TIM2_SMCFGR_ECE                         ((uint16_t)0x4000) /* External clock enable */
#define TIM2_SMCFGR_ETP                         ((uint16_t)0x8000) /* External trigger polarity */

/*******************  Bit definition for TIM2_DMAINTENR register  *************/
#define TIM2_DMAINTENR_UIE                      ((uint16_t)0x0001) /* Update interrupt enable */
#define TIM2_DMAINTENR_CC1IE                    ((uint16_t)0x0002) /* Capture/Compare 1 interrupt enable */
#define TIM2_DMAINTENR_CC2IE                    ((uint16_t)0x0004) /* Capture/Compare 2 interrupt enable */
#define TIM2_DMAINTENR_CC3IE                    ((uint16_t)0x0008) /* Capture/Compare 3 interrupt enable */
#define TIM2_DMAINTENR_CC4IE                    ((uint16_t)0x0010) /* Capture/Compare 4 interrupt enable */
#define TIM2_DMAINTENR_TIE                      ((uint16_t)0x0040) /* Trigger interrupt enable */
#define TIM2_DMAINTENR_UDE                      ((uint16_t)0x0100) /* Update DMA request enable */
#define TIM2_DMAINTENR_CC1DE                    ((uint16_t)0x0200) /* Capture/Compare 1 DMA request enable */
#define TIM2_DMAINTENR_CC2DE                    ((uint16_t)0x0400) /* Capture/Compare 2 DMA request enable */
#define TIM2_DMAINTENR_CC3DE                    ((uint16_t)0x0800) /* Capture/Compare 3 DMA request enable */
#define TIM2_DMAINTENR_CC4DE                    ((uint16_t)0x1000) /* Capture/Compare 4 DMA request enable */
#define TIM2_DMAINTENR_TDE                      ((uint16_t)0x4000) /* Trigger DMA request enable */

/*******************  Bit definition for TIM2_INTFR register  *****************/
#define TIM2_INTFR_UIF                          ((uint16_t)0x0001) /* Update interrupt Flag */
#define TIM2_INTFR_CC1IF                        ((uint16_t)0x0002) /* Capture/Compare 1 interrupt Flag */
#define TIM2_INTFR_CC2IF                        ((uint16_t)0x0004) /* Capture/Compare 2 interrupt Flag */
#define TIM2_INTFR_CC3IF                        ((uint16_t)0x0008) /* Capture/Compare 3 interrupt Flag */
#define TIM2_INTFR_CC4IF                        ((uint16_t)0x0010) /* Capture/Compare 4 interrupt Flag */
#define TIM2_INTFR_TIF                          ((uint16_t)0x0040) /* Trigger interrupt Flag */
#define TIM2_INTFR_CC1OF                        ((uint16_t)0x0200) /* Capture/Compare 1 Overcapture Flag */
#define TIM2_INTFR_CC2OF                        ((uint16_t)0x0400) /* Capture/Compare 2 Overcapture Flag */
#define TIM2_INTFR_CC3OF                        ((uint16_t)0x0800) /* Capture/Compare 3 Overcapture Flag */
#define TIM2_INTFR_CC4OF                        ((uint16_t)0x1000) /* Capture/Compare 4 Overcapture Flag */

/*******************  Bit definition for TIM2_SWEVGR register  ****************/
#define TIM2_SWEVGR_UG                          ((uint16_t)0x0001) /* Update Generation */
#define TIM2_SWEVGR_CC1G                        ((uint16_t)0x0002) /* Capture/Compare 1 Generation */
#define TIM2_SWEVGR_CC2G                        ((uint16_t)0x0004) /* Capture/Compare 2 Generation */
#define TIM2_SWEVGR_CC3G                        ((uint16_t)0x0008) /* Capture/Compare 3 Generation */
#define TIM2_SWEVGR_CC4G                        ((uint16_t)0x0010) /* Capture/Compare 4 Generation */
#define TIM2_SWEVGR_TG                          ((uint16_t)0x0040) /* Trigger Generation */

/******************  Bit definition for TIM2_CHCTLR1 register  ****************/
#define TIM2_CHCTLR1_CC1S                       ((uint16_t)0x0003) /* CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define TIM2_CHCTLR1_CC1S_0                     ((uint16_t)0x0001) /* Bit 0 */
#define TIM2_CHCTLR1_CC1S_1                     ((uint16_t)0x0002) /* Bit 1 */

#define TIM2_CHCTLR1_OC1FE                      ((uint16_t)0x0004) /* Output Compare 1 Fast enable */
#define TIM2_CHCTLR1_OC1PE                      ((uint16_t)0x0008) /* Output Compare 1 Preload enable */

#define TIM2_CHCTLR1_OC1M                       ((uint16_t)0x0070) /* OC1M[2:0] bits (Output Compare 1 Mode) */
#define TIM2_CHCTLR1_OC1M_0                     ((uint16_t)0x0010) /* Bit 0 */
#define TIM2_CHCTLR1_OC1M_1                     ((uint16_t)0x0020) /* Bit 1 */
#define TIM2_CHCTLR1_OC1M_2                     ((uint16_t)0x0040) /* Bit 2 */

