kholia/hal_wch/ch32fun/ch32x00xhw.h
#define TIM2_CHCTLR1_OC1CE                      ((uint16_t)0x0080) /* Output Compare 1Clear Enable */

#define TIM2_CHCTLR1_CC2S                       ((uint16_t)0x0300) /* CC2S[1:0] bits (Capture/Compare 2 Selection) */
#define TIM2_CHCTLR1_CC2S_0                     ((uint16_t)0x0100) /* Bit 0 */
#define TIM2_CHCTLR1_CC2S_1                     ((uint16_t)0x0200) /* Bit 1 */

#define TIM2_CHCTLR1_OC2FE                      ((uint16_t)0x0400) /* Output Compare 2 Fast enable */
#define TIM2_CHCTLR1_OC2PE                      ((uint16_t)0x0800) /* Output Compare 2 Preload enable */

#define TIM2_CHCTLR1_OC2M                       ((uint16_t)0x7000) /* OC2M[2:0] bits (Output Compare 2 Mode) */
#define TIM2_CHCTLR1_OC2M_0                     ((uint16_t)0x1000) /* Bit 0 */
#define TIM2_CHCTLR1_OC2M_1                     ((uint16_t)0x2000) /* Bit 1 */
#define TIM2_CHCTLR1_OC2M_2                     ((uint16_t)0x4000) /* Bit 2 */

#define TIM2_CHCTLR1_OC2CE                      ((uint16_t)0x8000) /* Output Compare 2 Clear Enable */

#define TIM2_CHCTLR1_IC1PSC                     ((uint16_t)0x000C) /* IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
#define TIM2_CHCTLR1_IC1PSC_0                   ((uint16_t)0x0004) /* Bit 0 */
#define TIM2_CHCTLR1_IC1PSC_1                   ((uint16_t)0x0008) /* Bit 1 */

#define TIM2_CHCTLR1_IC1F                       ((uint16_t)0x00F0) /* IC1F[3:0] bits (Input Capture 1 Filter) */
#define TIM2_CHCTLR1_IC1F_0                     ((uint16_t)0x0010) /* Bit 0 */
#define TIM2_CHCTLR1_IC1F_1                     ((uint16_t)0x0020) /* Bit 1 */
#define TIM2_CHCTLR1_IC1F_2                     ((uint16_t)0x0040) /* Bit 2 */
#define TIM2_CHCTLR1_IC1F_3                     ((uint16_t)0x0080) /* Bit 3 */

#define TIM2_CHCTLR1_IC2PSC                     ((uint16_t)0x0C00) /* IC2PSC[1:0] bits (Input Capture 2 Prescaler) */
#define TIM2_CHCTLR1_IC2PSC_0                   ((uint16_t)0x0400) /* Bit 0 */
#define TIM2_CHCTLR1_IC2PSC_1                   ((uint16_t)0x0800) /* Bit 1 */

#define TIM2_CHCTLR1_IC2F                       ((uint16_t)0xF000) /* IC2F[3:0] bits (Input Capture 2 Filter) */
#define TIM2_CHCTLR1_IC2F_0                     ((uint16_t)0x1000) /* Bit 0 */
#define TIM2_CHCTLR1_IC2F_1                     ((uint16_t)0x2000) /* Bit 1 */
#define TIM2_CHCTLR1_IC2F_2                     ((uint16_t)0x4000) /* Bit 2 */
#define TIM2_CHCTLR1_IC2F_3                     ((uint16_t)0x8000) /* Bit 3 */

/******************  Bit definition for TIM2_CHCTLR2 register  ****************/
#define TIM2_CHCTLR2_CC3S                       ((uint16_t)0x0003) /* CC3S[1:0] bits (Capture/Compare 3 Selection) */
#define TIM2_CHCTLR2_CC3S_0                     ((uint16_t)0x0001) /* Bit 0 */
#define TIM2_CHCTLR2_CC3S_1                     ((uint16_t)0x0002) /* Bit 1 */

#define TIM2_CHCTLR2_OC3FE                      ((uint16_t)0x0004) /* Output Compare 3 Fast enable */
#define TIM2_CHCTLR2_OC3PE                      ((uint16_t)0x0008) /* Output Compare 3 Preload enable */

#define TIM2_CHCTLR2_OC3M                       ((uint16_t)0x0070) /* OC3M[2:0] bits (Output Compare 3 Mode) */
#define TIM2_CHCTLR2_OC3M_0                     ((uint16_t)0x0010) /* Bit 0 */
#define TIM2_CHCTLR2_OC3M_1                     ((uint16_t)0x0020) /* Bit 1 */
#define TIM2_CHCTLR2_OC3M_2                     ((uint16_t)0x0040) /* Bit 2 */

#define TIM2_CHCTLR2_OC3CE                      ((uint16_t)0x0080) /* Output Compare 3 Clear Enable */

#define TIM2_CHCTLR2_CC4S                       ((uint16_t)0x0300) /* CC4S[1:0] bits (Capture/Compare 4 Selection) */
#define TIM2_CHCTLR2_CC4S_0                     ((uint16_t)0x0100) /* Bit 0 */
#define TIM2_CHCTLR2_CC4S_1                     ((uint16_t)0x0200) /* Bit 1 */

#define TIM2_CHCTLR2_OC4FE                      ((uint16_t)0x0400) /* Output Compare 4 Fast enable */
#define TIM2_CHCTLR2_OC4PE                      ((uint16_t)0x0800) /* Output Compare 4 Preload enable */

#define TIM2_CHCTLR2_OC4M                       ((uint16_t)0x7000) /* OC4M[2:0] bits (Output Compare 4 Mode) */
#define TIM2_CHCTLR2_OC4M_0                     ((uint16_t)0x1000) /* Bit 0 */
#define TIM2_CHCTLR2_OC4M_1                     ((uint16_t)0x2000) /* Bit 1 */
#define TIM2_CHCTLR2_OC4M_2                     ((uint16_t)0x4000) /* Bit 2 */

#define TIM2_CHCTLR2_OC4CE                      ((uint16_t)0x8000) /* Output Compare 4 Clear Enable */

#define TIM2_CHCTLR2_IC3PSC                     ((uint16_t)0x000C) /* IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
#define TIM2_CHCTLR2_IC3PSC_0                   ((uint16_t)0x0004) /* Bit 0 */
#define TIM2_CHCTLR2_IC3PSC_1                   ((uint16_t)0x0008) /* Bit 1 */

#define TIM2_CHCTLR2_IC3F                       ((uint16_t)0x00F0) /* IC3F[3:0] bits (Input Capture 3 Filter) */
#define TIM2_CHCTLR2_IC3F_0                     ((uint16_t)0x0010) /* Bit 0 */
#define TIM2_CHCTLR2_IC3F_1                     ((uint16_t)0x0020) /* Bit 1 */
#define TIM2_CHCTLR2_IC3F_2                     ((uint16_t)0x0040) /* Bit 2 */
#define TIM2_CHCTLR2_IC3F_3                     ((uint16_t)0x0080) /* Bit 3 */

#define TIM2_CHCTLR2_IC4PSC                     ((uint16_t)0x0C00) /* IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
#define TIM2_CHCTLR2_IC4PSC_0                   ((uint16_t)0x0400) /* Bit 0 */
#define TIM2_CHCTLR2_IC4PSC_1                   ((uint16_t)0x0800) /* Bit 1 */

#define TIM2_CHCTLR2_IC4F                       ((uint16_t)0xF000) /* IC4F[3:0] bits (Input Capture 4 Filter) */
#define TIM2_CHCTLR2_IC4F_0                     ((uint16_t)0x1000) /* Bit 0 */
#define TIM2_CHCTLR2_IC4F_1                     ((uint16_t)0x2000) /* Bit 1 */
#define TIM2_CHCTLR2_IC4F_2                     ((uint16_t)0x4000) /* Bit 2 */
#define TIM2_CHCTLR2_IC4F_3                     ((uint16_t)0x8000) /* Bit 3 */

/*******************  Bit definition for TIM2_CCER register  ******************/
#define TIM2_CCER_CC1E                          ((uint16_t)0x0001) /* Capture/Compare 1 output enable */
#define TIM2_CCER_CC1P                          ((uint16_t)0x0002) /* Capture/Compare 1 output Polarity */
#define TIM2_CCER_CC2E                          ((uint16_t)0x0010) /* Capture/Compare 2 output enable */
#define TIM2_CCER_CC2P                          ((uint16_t)0x0020) /* Capture/Compare 2 output Polarity */
#define TIM2_CCER_CC3E                          ((uint16_t)0x0100) /* Capture/Compare 3 output enable */
#define TIM2_CCER_CC3P                          ((uint16_t)0x0200) /* Capture/Compare 3 output Polarity */
#define TIM2_CCER_CC4E                          ((uint16_t)0x1000) /* Capture/Compare 4 output enable */
#define TIM2_CCER_CC4P                          ((uint16_t)0x2000) /* Capture/Compare 4 output Polarity */

