kholia/hal_wch/ch32fun/ch32x00xhw.h
/*******************  Bit definition for TIM2_CNT register  *******************/
#define TIM2_CNT                                ((uint16_t)0xFFFF) /* Counter Value */

/*******************  Bit definition for TIM2_PSC register  *******************/
#define TIM2_PSC                                ((uint16_t)0xFFFF) /* Prescaler Value */

/*******************  Bit definition for TIM2_ATRLR register  *****************/
#define TIM2_ATRLR                              ((uint16_t)0xFFFF) /* actual auto-reload Value */

/*******************  Bit definition for TIM2_CH1CVR register  ****************/
#define TIM2_CH1CVR_CH1CVR                      ((uint32_t)0x0000FFFF) /* Capture/Compare 1 Value[15:0] */
#define TIM2_CH1CVR_LEVEL1                      ((uint32_t)0x00010000) /* The level indication bit corresponding to the captured value */

/*******************  Bit definition for TIM2_CH2CVR register  ****************/
#define TIM2_CH2CVR_CH2CVR                      ((uint32_t)0x0000FFFF) /* Capture/Compare 2 Value */
#define TIM2_CH2CVR_LEVEL2                      ((uint32_t)0x00010000) /* The level indication bit corresponding to the captured value */

/*******************  Bit definition for TIM2_CH3CVR register  ****************/
#define TIM2_CH3CVR_CH3CVR                      ((uint32_t)0x0000FFFF) /* Capture/Compare 3 Value */
#define TIM2_CH3CVR_LEVEL3                      ((uint32_t)0x00010000) /* The level indication bit corresponding to the captured value */

/*******************  Bit definition for TIM2_CH4CVR register  ****************/
#define TIM2_CH4CVR_CH4CVR                      ((uint32_t)0x0000FFFF) /* Capture/Compare 4 Value */
#define TIM2_CH4CVR_LEVEL4                      ((uint32_t)0x00010000) /* The level indication bit corresponding to the captured value */

/*******************  Bit definition for TIM2_DTCR register  ******************/
#define TIM2_DTCR_OC1N_EN                       ((uint16_t)0x0001) /* Complementary output CH1 EN */
#define TIM2_DTCR_OC2N_EN                       ((uint16_t)0x0002) /* Complementary output CH2 EN */
#define TIM2_DTCR_DT1_P                         ((uint16_t)0x0004) /* Complementary output CH1 POL */
#define TIM2_DTCR_DT1N_P                        ((uint16_t)0x0008) /* Complementary output CH1 compliment POL */
#define TIM2_DTCR_DT2_P                         ((uint16_t)0x0010) /* Complementary output CH2 POL */
#define TIM2_DTCR_DT2N_P                        ((uint16_t)0x0020) /* Complementary output CH2 compliment POL */

#define TIM2_DTCR_DT1                           ((uint16_t)0x0F00) /* DT1[3:0] bits (Dead-Time Generator set-up) */
#define TIM2_DTCR_DT1_0                         ((uint16_t)0x0100) /* Bit 0 */
#define TIM2_DTCR_DT1_1                         ((uint16_t)0x0200) /* Bit 1 */
#define TIM2_DTCR_DT1_2                         ((uint16_t)0x0400) /* Bit 2 */
#define TIM2_DTCR_DT1_3                         ((uint16_t)0x0800) /* Bit 3 */

#define TIM2_DTCR_DT2                           ((uint16_t)0x0F00) /* DT2[3:0] bits (Dead-Time Generator set-up) */
#define TIM2_DTCR_DT2_0                         ((uint16_t)0x0100) /* Bit 0 */
#define TIM2_DTCR_DT2_1                         ((uint16_t)0x0200) /* Bit 1 */
#define TIM2_DTCR_DT2_2                         ((uint16_t)0x0400) /* Bit 2 */
#define TIM2_DTCR_DT2_3                         ((uint16_t)0x0800) /* Bit 3 */

/*******************  Bit definition for TIM2_DMACFGR register  ***************/
#define TIM2_DMACFGR_DBA                        ((uint16_t)0x001F) /* DBA[4:0] bits (DMA Base Address) */
#define TIM2_DMACFGR_DBA_0                      ((uint16_t)0x0001) /* Bit 0 */
#define TIM2_DMACFGR_DBA_1                      ((uint16_t)0x0002) /* Bit 1 */
#define TIM2_DMACFGR_DBA_2                      ((uint16_t)0x0004) /* Bit 2 */
#define TIM2_DMACFGR_DBA_3                      ((uint16_t)0x0008) /* Bit 3 */
#define TIM2_DMACFGR_DBA_4                      ((uint16_t)0x0010) /* Bit 4 */

#define TIM2_DMACFGR_DBL                        ((uint16_t)0x1F00) /* DBL[4:0] bits (DMA Burst Length) */
#define TIM2_DMACFGR_DBL_0                      ((uint16_t)0x0100) /* Bit 0 */
#define TIM2_DMACFGR_DBL_1                      ((uint16_t)0x0200) /* Bit 1 */
#define TIM2_DMACFGR_DBL_2                      ((uint16_t)0x0400) /* Bit 2 */
#define TIM2_DMACFGR_DBL_3                      ((uint16_t)0x0800) /* Bit 3 */
#define TIM2_DMACFGR_DBL_4                      ((uint16_t)0x1000) /* Bit 4 */

/*******************  Bit definition for TIM2_DMAADR register  ****************/
#define TIM2_DMAADR_DMAB                         ((uint16_t)0xFFFF) /* DMA register for burst accesses */

/******************************************************************************/
/*                                    TIM3                                    */
/******************************************************************************/

/*******************  Bit definition for TIM3_CTLR register  ******************/
#define TIM3_CTLR_CEN                           ((uint16_t)0x0001) /* Counter enable */
#define TIM3_CTLR_UDIS                          ((uint16_t)0x0002) /* Update disable */
#define TIM3_CTLR_DIR                           ((uint16_t)0x0010) /* Direction */
#define TIM3_CTLR_CMS                           ((uint16_t)0x0060) /* CMS[1:0] bits (Center-aligned mode selection) */
#define TIM3_CTLR_CMS_0                         ((uint16_t)0x0020) /* Bit 0 */
#define TIM3_CTLR_CMS_1                         ((uint16_t)0x0040) /* Bit 1 */

#define TIM3_CTLR_ARPE                          ((uint16_t)0x0080) /* Auto-reload preload enable */

#define TIM3_CTLR_SMS                           ((uint16_t)0x0700) /* SMS[2:0] bits clock source */
#define TIM3_CTLR_SMS_0                         ((uint16_t)0x0100) /* Bit 0 */
#define TIM3_CTLR_SMS_1                         ((uint16_t)0x0200) /* Bit 1 */
#define TIM3_CTLR_SMS_2                         ((uint16_t)0x0400) /* Bit 2 */

/*******************  Bit definition for TIM3_DMAINTENR register  *************/
#define TIM3_DMAINTENR_OC1PE                    ((uint16_t)0x0001) /* Compare 1 preload enable */
#define TIM3_DMAINTENR_OC2PE                    ((uint16_t)0x0002) /* Compare 2 preload enable */
#define TIM3_DMAINTENR_OC3PE                    ((uint16_t)0x0004) /* Compare 3 preload enable */
#define TIM3_DMAINTENR_OC4PE                    ((uint16_t)0x0008) /* Compare 4 preload enable */
#define TIM3_DMAINTENR_CC3DE                    ((uint16_t)0x0800) /* Compare 3 DMA request enable */
#define TIM3_DMAINTENR_CC4DE                    ((uint16_t)0x1000) /* Compare 4 DMA request enable */

/*******************  Bit definition for TIM3_CNT register  *******************/
#define TIM3_CNT                                ((uint16_t)0xFFFF) /* Counter Value */

