kholia/hal_wch/ch32fun/ch32x00xhw.h
/*******************  Bit definition for TIM3_ATRLR register  *****************/
#define TIM3_ATRLR                              ((uint16_t)0xFFFF) /* actual auto-reload Value */

/*******************  Bit definition for TIM3_CH1CVR register  ****************/
#define TIM3_CH1CVR_CH1CVR                      ((uint16_t)0xFFFF) /* Compare 1 Value[15:0] */

/*******************  Bit definition for TIM3_CH2CVR register  ****************/
#define TIM3_CH2CVR_CH2CVR                      ((uint16_t)0xFFFF) /* Compare 2 Value */

/*******************  Bit definition for TIM3_CH3CVR register  ****************/
#define TIM3_CH3CVR_CH3CVR                      ((uint16_t)0xFFFF) /* Compare 3 Value */

/*******************  Bit definition for TIM3_CH4CVR register  ****************/
#define TIM3_CH4CVR_CH4CVR                      ((uint16_t)0xFFFF) /* Compare 4 Value */

/******************************************************************************/
/*         Universal Synchronous Asynchronous Receiver Transmitter            */
/******************************************************************************/

/*******************  Bit definition for USART_STATR register  ****************/
#define USART_STATR_PE                          ((uint32_t)0x00000001) /* Parity Error */
#define USART_STATR_FE                          ((uint32_t)0x00000002) /* Framing Error */
#define USART_STATR_NE                          ((uint32_t)0x00000004) /* Noise Error Flag */
#define USART_STATR_ORE                         ((uint32_t)0x00000008) /* OverRun Error */
#define USART_STATR_IDLE                        ((uint32_t)0x00000010) /* IDLE line detected */
#define USART_STATR_RXNE                        ((uint32_t)0x00000020) /* Read Data Register Not Empty */
#define USART_STATR_TC                          ((uint32_t)0x00000040) /* Transmission Complete */
#define USART_STATR_TXE                         ((uint32_t)0x00000080) /* Transmit Data Register Empty */
#define USART_STATR_LBD                         ((uint32_t)0x00000100) /* LIN Break Detection Flag */
#define USART_STATR_CTS                         ((uint32_t)0x00000200) /* CTS Flag */

/*******************  Bit definition for USART_DATAR register  ****************/
#define USART_DATAR_DR                          ((uint32_t)0x000001FF) /* Data value */

/******************  Bit definition for USART_BRR register  *******************/
#define USART_BRR_DIV_Fraction                  ((uint32_t)0x0000000F) /* Fraction of USARTDIV */
#define USART_BRR_DIV_Mantissa                  ((uint32_t)0x0000FFF0) /* Mantissa of USARTDIV */

/******************  Bit definition for USART_CTLR1 register  *****************/
#define USART_CTLR1_SBK                         ((uint32_t)0x00000001) /* Send Break */
#define USART_CTLR1_RWU                         ((uint32_t)0x00000002) /* Receiver wakeup */
#define USART_CTLR1_RE                          ((uint32_t)0x00000004) /* Receiver Enable */
#define USART_CTLR1_TE                          ((uint32_t)0x00000008) /* Transmitter Enable */
#define USART_CTLR1_IDLEIE                      ((uint32_t)0x00000010) /* IDLE Interrupt Enable */
#define USART_CTLR1_RXNEIE                      ((uint32_t)0x00000020) /* RXNE Interrupt Enable */
#define USART_CTLR1_TCIE                        ((uint32_t)0x00000040) /* Transmission Complete Interrupt Enable */
#define USART_CTLR1_TXEIE                       ((uint32_t)0x00000080) /* PE Interrupt Enable */
#define USART_CTLR1_PEIE                        ((uint32_t)0x00000100) /* PE Interrupt Enable */
#define USART_CTLR1_PS                          ((uint32_t)0x00000200) /* Parity Selection */
#define USART_CTLR1_PCE                         ((uint32_t)0x00000400) /* Parity Control Enable */
#define USART_CTLR1_WAKE                        ((uint32_t)0x00000800) /* Wakeup method */
#define USART_CTLR1_M                           ((uint32_t)0x00001000) /* Word length */
#define USART_CTLR1_UE                          ((uint32_t)0x00002000) /* USART Enable */

/******************  Bit definition for USART_CTLR2 register  *****************/
#define USART_CTLR2_ADD                         ((uint32_t)0x0000000F) /* Address of the USART node */
#define USART_CTLR2_LBDL                        ((uint32_t)0x00000020) /* LIN Break Detection Length */
#define USART_CTLR2_LBDIE                       ((uint32_t)0x00000040) /* LIN Break Detection Interrupt Enable */

#define USART_CTLR2_STOP                        ((uint32_t)0x00003000) /* STOP[1:0] bits (STOP bits) */
#define USART_CTLR2_STOP_0                      ((uint32_t)0x00001000) /* Bit 0 */
#define USART_CTLR2_STOP_1                      ((uint32_t)0x00002000) /* Bit 1 */

#define USART_CTLR2_LINEN                       ((uint32_t)0x00004000) /* LIN mode enable */

/******************  Bit definition for USART_CTLR3 register  *****************/
#define USART_CTLR3_EIE                         ((uint32_t)0x00000001) /* Error Interrupt Enable */
#define USART_CTLR3_IREN                        ((uint32_t)0x00000002) /* IrDA mode Enable */
#define USART_CTLR3_IRLP                        ((uint32_t)0x00000004) /* IrDA Low-Power */
#define USART_CTLR3_HDSEL                       ((uint32_t)0x00000008) /* Half-Duplex Selection */
#define USART_CTLR3_DMAR                        ((uint32_t)0x00000040) /* DMA Enable Receiver */
#define USART_CTLR3_DMAT                        ((uint32_t)0x00000080) /* DMA Enable Transmitter */
#define USART_CTLR3_RTSE                        ((uint32_t)0x00000100) /* RTS Enable */
#define USART_CTLR3_CTSE                        ((uint32_t)0x00000200) /* CTS Enable */
#define USART_CTLR3_CTSIE                       ((uint32_t)0x00000400) /* CTS Interrupt Enable */

/******************  Bit definition for USART_GPR register  ******************/
#define USART_GPR_PSC                           ((uint32_t)0x000000FF) /* PSC[7:0] bits (Prescaler value) */
#define USART_GPR_PSC_0                         ((uint32_t)0x00000001) /* Bit 0 */
#define USART_GPR_PSC_1                         ((uint32_t)0x00000002) /* Bit 1 */
#define USART_GPR_PSC_2                         ((uint32_t)0x00000004) /* Bit 2 */
#define USART_GPR_PSC_3                         ((uint32_t)0x00000008) /* Bit 3 */
#define USART_GPR_PSC_4                         ((uint32_t)0x00000010) /* Bit 4 */
#define USART_GPR_PSC_5                         ((uint32_t)0x00000020) /* Bit 5 */
#define USART_GPR_PSC_6                         ((uint32_t)0x00000040) /* Bit 6 */
#define USART_GPR_PSC_7                         ((uint32_t)0x00000080) /* Bit 7 */


/******************************************************************************/
/*                            Window WATCHDOG                                 */
/******************************************************************************/

